function A = task8(n)
  A = zeros(n, n);
  for i=1:n    
    A(i, i)=((-1)^i)/2+1.5;
    O(i)=i;
    if i+1<=n 
      if rem(n, 2)==0
          A(n-length(O),n-O+1)=A(i, i);
          A(n-O+1,n-length(O))=A(i, i);
      else
          A(n-length(O),n-O+1)=((-1)^(i+1))/2+1.5;
          A(n-O+1,n-length(O))=((-1)^(i+1))/2+1.5;
      end
   end
end
%определитель матрицы в зависимости от размера будет 1, 1, -1, -1 и заново
%то есть при n=1, определитель = 1
%         при 2, 1
%         при 3, -1
%         при 4, -1
%         при 5, 1
%         при 6, 1
%         при 7, -1 и так далее
%Если делать разложение по строкам, то определитель = сумме(((-1)^n) * все перестановки
endfunction
